import teploLogo from "/logo.png";
import "./App.css";
import "./mobile.css";
import ItemCard from "./components/ItemCard";
import type { ItemCardProps } from "./types";

const itemsDataArr: ItemCardProps[] = [
  {
    name: "Ванільний гоголь-моголь",
    description: `Запах, що нагадує теплий вечір у родинному колі. Свічка з ароматом ванільного гоголь-моголю наповнює простір ніжною солодкістю вершкової ванілі, нотами збитих яєць і легкого мускатного присмаку. У повітрі тане шлейф карамелі, створюючи відчуття домашнього тепла й затишку.\nІдеальний для осінньо-зимових вечорів, читання книг або тихих розмов за горнятком чаю.\nМи використовуємо високоякісну аромаолію зі США, що дарує свічці насичений, стійкий аромат. Свічка виготовлена з натурального соєвого воску, який не містить шкідливих домішок, безпечний для здоров’я й навколишнього середовища. Його шовковиста текстура та чисте горіння це ознака справжньої якості.`,
    composition: `Склад:\n100 ml\n100% соєвий віск\nАромаолія зі США\n250 грн`,
  },
  {
    name: "Позолочений мандарин",
    description: `Аромат свіжого мандарина з легкою ноткою прянощів. Ніби сонячний ранок у грудні, коли мандаринова шкірка тріскає в руках, а повітря наповнюється святковим очікуванням. Ця свічка створює теплу атмосферу, де хочеться розслабитись, усміхатись і просто бути.\nПозолочений мандарин звучить яскраво, але не кричить. Його аромат природний і життєрадісний, він легко наповнює кімнату свіжістю цитрусу і легким теплом кориці чи гвоздики. Ідеальний для щоденного використання вдома чи в офісі.\n Ми використовуємо високоякісну аромаолію зі США, що дарує свічці насичений, стійкий аромат. Свічка виготовлена з натурального соєвого воску, який не містить шкідливих домішок, безпечний для здоров’я й навколишнього середовища. Його шовковиста текстура та чисте горіння це ознака справжньої якості.`,
    composition: `Склад:\n100 ml\n100% соєвий віск\nАромаолія зі США\n250 грн`,
  },
  {
    name: "Лаванда",
    description: `Спокій, якого часом так не вистачає. Аромат свічки "Лаванда" — це тиша літнього вечора, коли все завмирає, а повітря наповнене легким лавандовим шлейфом. Він допомагає розслабитись, відпустити зайве і просто відпочити.\nЛаванда заспокоює, знімає напругу та налаштовує на спокійний сон або тиху роботу. Її аромат ніжний, але впевнений, наповнює простір природною чистотою та гармонією. Ідеальний вибір для вечора на самоті або затишного вечора вдома.\nСвічка створена на основі соєвого воску, який гарно горить і не димить. Аромаолія має м’який, чистий склад і приємно розкривається в просторі. Усі компоненти підібрані так, щоб аромат був не просто приємним, а ще й комфортним у використанні.`,
    composition: `Склад:\n100 ml\n100% соєвий віск\nАромаолія зі США\n250 грн`,
  },
  {
    name: "Сантал і кокос",
    description: `Теплий деревний аромат з м’яким кокосовим післясмаком. Свічка "Сантал і кокос" — це спокій, як у невеликому дерев’яному будинку біля моря. Сандал додає глибини й затишку, а кокос пом’якшує і створює ніжну теплоту.\nАромат не різкий і не солодкий. Він розкривається поступово, легко огортає простір і створює спокійну атмосферу для відпочинку чи роботи. Підійде тим, хто любить природні, некричущі запахи з легким тропічним відтінком.\nМи використовуємо високоякісний соєвий віск. Він горить чисто і довго, не створює нагару і безпечний для щоденного використання. Справжня аромаолія імпортована зі США добре розкривається під час горіння.`,
    composition: `Склад:\n100 ml\n100% соєвий віск\nАромаолія зі США\n250 грн`,
  },
];
const itemsComponentsArr: React.ReactElement[] = [];

function appendItems(itemsDataArr: ItemCardProps[]) {
  for (const item of itemsDataArr) {
    itemsComponentsArr.push(
      <ItemCard
        name={item.name}
        description={item.description}
        composition={item.composition}
      />
    );
  }
}
if (itemsDataArr.length !== 0) {
  appendItems(itemsDataArr);
}
function App() {
  return (
    <>
      <header>
        <img
          className="logo-header"
          height="80px"
          width="auto"
          src={teploLogo}
          alt=""
        />
        <hr className="header-bottom"></hr>
      </header>

      <div className="cards-container">
        {/* <ItemCard name="Ванільний гоголь-моголь" />
        <ItemCard name="Позолочений мандарин" />
        <ItemCard name="Лаванда" />
        <ItemCard name="Сантал і кокос" /> */}
        {itemsComponentsArr}
      </div>
      <footer>
        <a href="">Про нас</a>
        <a href="https://www.instagram.com/teploporuch/">Instagram</a>
      </footer>
      {/* <div className="card">
        <button onClick={() => setCount((count) => count + 1)}>
          count is {count}
        </button>
      </div> */}
    </>
  );
}

export default App;
